-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: localhost    Database: northtrek
-- ------------------------------------------------------
-- Server version	9.4.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `parks`
--

DROP TABLE IF EXISTS `parks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `parks` (
  `park_id` int NOT NULL AUTO_INCREMENT,
  `park_name` varchar(255) DEFAULT NULL,
  `park_phone` text,
  `park_location` text,
  `park_email` text,
  `park_activity` text,
  `park_biome` text,
  `park_animal` text,
  `park_fee` text,
  PRIMARY KEY (`park_id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `parks`
--

LOCK TABLES `parks` WRITE;
/*!40000 ALTER TABLE `parks` DISABLE KEYS */;
INSERT INTO `parks` VALUES (1,'อุทยานแห่งชาติขุนขาน','0 5200 0410','หมู่ 1 ต.แม่สาบ อ.สะเมิง จ.เชียงใหม่ 50250','Khunkhan_np@hotmail.com','ทางเดินศึกษาธรรมชาติ, เที่ยวถ้ำ/ศึกษาสภาพธรณี, ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ดูดาว, ตั้งแคมป์พักแรม','ป่าดิบเขา, ป่าดิบแล้ง, ป่าสนเขา, ป่าเบญจพรรณ, ป่าเต็งรัง','เก้ง, หมูป่า, ไก่ป่า, เม่น, หมาไน, หมาจิ้งจอก, นิ่ม, ตุ่น, กระรอก, กระต่ายป่า, บ่าง, ค้างคาว, อีเห็น, พังพอน, ลิง, ชะนี, เสือ, เลียงผา, นกกก','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(2,'อุทยานแห่งชาติดอยผ้าห่มปก','0 5208 0801, 084 483 4689','224 ม.6 ต.โป่งน้ำร้อน อ.ฝาง จ.เชียงใหม่ 50110','doiphahompok.np@hotmail.com','ทางเดินศึกษาธรรมชาติ , เที่ยวน้ำตก , เที่ยวถ้ำ/ศึกษาสภาพธรณี , ชมพรรณไม้ , ดูนก/ดูผีเสื้อ , ดูดาว , อาบน้ำแร่/อบไอน้ำ , ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าสนเขา, ป่าดิบเขา','หมาไม้, หมีควาย, เก้ง, หมูป่า, เม่นใหญ่, กระต่ายป่า, ลิงกัง, ค่างแว่นถิ่นเหนือ, กระรอกท้องแดง, กระรอกดินแก้มแดง, กระรอกบินจิ๋วท้องขาว, เพียงพอนเส้นหลังขาว, เพียงพอนท้องเหลือง, นกติ๊ดหัวแดง, นกขัติยา, นกกระรางอกลาย, นกหัวขวานอกแดง, นกเดินดงสีน้ำตาลแดง, นกเดินดงอกเทา, นกเดินดงสีคล้ำ, นกเดินดงลายเสือ, กิ้งก่าแก้ว, เต่าปูลู, เต่าหก, งูลายสาบคอแดง, งูทางมะพร้าวแดง, งูสามเหลี่ยม, ตะกวด, กบดอยผ้าห่มปก, อึ่งอ่างบ้าน, กบหนอง, อึ่งแม่หนาว, อึ่งกรายห้วยเล็ก, ปาดตีนเหลืองเหนือ, กระท่าง','ชาวไทย: ผู้ใหญ่ 60 บาท เด็ก 30 บาท, ชาวต่างชาติ: ผู้ใหญ่ 300 บาท เด็ก 150 บาท'),(3,'อุทยานแห่งชาติดอยเวียงผา','087 186 2118, 0 5331 7535','หมู่ที่ 8 ต.ศรีดงเย็น อ.ไชยปราการ จ.เชียงใหม่','doiwiangpha@hotmail.com','ทางเดินศึกษาธรรมชาติ, ทางเดินป่า, เที่ยวน้ำตก, เที่ยวน้ำตก, ชมพรรณไม้, ดูนก/ดูผีเสื้อ','ป่าเบญจพรรณ, ป่าเต็งรัง, ป่าดิบเขา, ป่าดิบแล้ง, ป่าสนเขา','เก้ง, หมูป่า, เลียงผา, เสือไฟ, หมีควาย, เม่น, กระต่ายป่า, ลิง, อีเห็น, กระรอก, กระแต, นก','ไม่เก็บค่าบริการ'),(4,'อุทยานแห่งชาติดอยสุเทพ-ปุย','0 5321 0244','ถนนศรีวิชัย ตำบลสุเทพ อำเภอเมือง จังหวัดเชียงใหม่ 50200','doisutheppui@gmail.com','ทางเดินศึกษาธรรมชาติ, เที่ยวน้ำตก, ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ส่องสัตว์, จักรยาน/จักรยานเสือภูเขา, ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าดิบเขา','หมูป่า, อีเห็นเครือ, อีเห็นข้างลาย, เม่นหางพวง, อ้นเล็ก, กระจ้อน, กระเล็นขนปลายหูสั้น, ค้างคาวมงกุฎเล็ก, หนูขนเสี้ยนดอย, หนูท้องขาว, เต่าปูลู, จิ้งจกบ้านหางแบนเล็ก, กิ้งก่าหัวแดง, งูสายม่านพระอินทร์, งูแส้หางม้าเทา, อึ่งกรายหัวเล็ก, กบหนอง, อึ่งขาคำ','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(5,'อุทยานแห่งชาติดอยอินทนนท์','0 5328 6729','119 หมู่7 ต.บ้านหลวง อ.จอมทอง จ.เชียงใหม่ 50160','inthanon98dnp@hotmail.com','ทางเดินศึกษาธรรมชาติ , เที่ยวน้ำตก , ชมพรรณไม้ , ดูนก/ดูผีเสื้อ , ส่องสัตว์ , ดูดาว , จักรยาน/จักรยานเสือภูเขา , ชมประวัติศาสตร์/วัฒนธรรม , ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าดิบเขาตอนล่าง, ป่าดิบเขาตอนบน','กระรอก, กระแตธรรมดา, กระเล็นขนปลายหูสั้น, อ้นเล็ก, เม่นหางพวง, อีเห็นข้างลาย, ชะมดแผงสันหางดำ, นกแซงแซวเล็กเหลือบ, นกปรอดหัวสีเขม่า, นกเด้าดินทุ่ง, เหยี่ยว, ไก่ฟ้าหลังขาว, นกเงือกคอแดง, นกพญาไฟสีกุหลาบ, กิ้งก่าหัวสีฟ้า, จิ้งเหลนเรียวจุดดำ, ตุ๊กแกบ้าน, งูลายสอคอแดง, กบห้วยสีข้างดำ, เขียดหนอง, อึ่งกราย, คางคกเล็ก, ปาดแคระ, หนูหญ้าดอย, กระท่าง, เต่าปูลู, นกศิวะหางสีน้ำตาล, นกปีกสั้นสีนำเงิน, นกกระจิ๊ดคอสีเทา, นกกินปลีหางยาว','ชาวไทย: ผู้ใหญ่ 60 บาท เด็ก 30 บาท, ชาวต่างชาติ: ผู้ใหญ่ 300 บาท เด็ก 150 บาท'),(6,'อุทยานแห่งชาติน้ำตกบัวตอง - น้ำพุเจ็ดสี','093 193 3556','หมู่ที่ 8 ต.แม่หอพระ อ.แม่แตง จ.เชียงใหม่','namtokbuatong@gmail.com','ทางเดินศึกษาธรรมชาติ, ทางเดินป่า, เที่ยวน้ำตก, ดูนก/ดูผีเสื้อ','ป่าดิบชื้น, ป่าเบญจพรรณ, ป่าเต็งรัง','นก, เก้ง, หมูป่า, ลิง, อีเห็น, หมาใน, หมูหริ่ง, แมวป่า, เม่น, พังพอน, กระต่ายป่า, กระรอก, กระรอกบิน, กระแต, ค้างคาว, เต่าใบไม้, ตะพาบน้ำ, กบ, กบจุก, เขียดแล้ว, อึ่งอ่าง, คางคก, ปูจั่ว, ปูเหล็ก, งูเหลือม, งูหลาม, งูจงอาง, งูเห่า, งูกระปะ(งูเปา), งูสามเหลี่ยม, งูเขียวหางไหม้, ลิ่น, ตุ๊กแก, กิ้งก่า, จิ้งเหลน, ตะกวด, ปลาช่อน, ปลาดุก, ปลากั้ง, ปลาซิว, ปลาปกขาว, ปลาหลอดหรือปลามัน, ปลาปั่น, ปลาขี้สุ่น, ปลากระทิง, ปลาหลด, ปลาน้ำหมึก, ปลาเข็ม, ปลาไหล, ปลาหมอ','ไม่เก็บค่าบริการ'),(7,'อุทยานแห่งชาติผาแดง','0 5304 6370','หมู่ 3 บ้านนาหวาย ตำบลเมืองนะ อำเภอเชียงดาว จังหวัดเชียงใหม่ 50170','np.phadaeng@hotmail.com','ทางเดินศึกษาธรรมชาติ, เที่ยวน้ำตก, ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ตั้งแคมป์พักแรม','ป่าเบญจพรรณ, ป่าเต็งรัง, ป่าดิบเขา, ป่าสนเขา','กวางผา, เลียงผา, เก้ง, หมู่ป่า, เม่น, หมี, ค่าง, อีเห็น, นางอาย (ลิงลม), กระรอก, เต่าปูรู, เขียดแหลว','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(8,'อุทยานแห่งชาติแม่ตะไคร้','0 5200 0832 , 09 5694 5052','อุทยานแห่งชาติแม่ตะไคร้	36 หมู่ 3 บ้านแม่หวาน ต.ป่าเมี่ยง อ.ดอยสะเก็ด จ.เชียงใหม่ 50220','sarbanmaetakhrai@dnp.mail.go.th','ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ดูดาว, ตั้งแคมป์พักแรม','ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าเต็งรัง, ป่าสนเขา, ป่าดิบเขา','เก้ง, กวางป่า, กระต่ายป่า, ลิง, ชะนี, ชะมด, เม่น, อีเห็น, เสือโคร่ง, หมูป่า, เลียงผา, หมี, นกกางเขนดง, นกแซงแซวหางม่วง, นกหัวขวาน, นกยูง, นกขุนทอง, นกยาง, ไก่ป่า, นกเค้าแมว, นกกระปูด, กิ้งก่าชนิดต่างๆ, งูชนิดต่างๆ, เต่า, กบ, อึ่ง, ปาด, ผีเสื้อหางดาบตาลไหม้, ด้วงคีมยีราฟ','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(9,'อุทยานแห่งชาติแม่โถ','089 526 0116','อุทยานแห่งชาติแม่โถ ตู้ ปณ.10 ปณจ.ฮอด อ.ฮอด จ.เชียงใหม่ 50240','maetho41@gmail.com','ทางเดินศึกษาธรรมชาติ, ชมพรรณไม้, เที่ยวน้ำตก, ดูนก/ดูผีเสื้อ, ดูดาว, ล่องแก่ง, ตั้งแคมป์พักแรม','ป่าดิบชื้น, ป่าดิบเขา, ป่าเบญจพรรณ, ป่าสนเขา','กระทิง, กวางป่า, เลียงผา, เก้ง, หมีควาย, ชะนี, ลิง, ค่าง, อีเห็น, กระต่ายป่า, หมูป่า, ช้างป่า, นกยูง, ไก่ฟ้า, ไก่ป่า, นกแก้ว, นกขุนทอง, นกขุนแผน, เหยี่ยว, งูเหลือม, งูหลาม, งูเห่า, ตะกวด, แย้, เต่า, ตะพาบน้ำ, กบ, เขียด, อึ่งอ่าง','ไม่เก็บค่าบริการ'),(10,'อุทยานแห่งชาติแม่วาง','053 106 759','ต.สันติสุข อำเภอดอยหล่อ จ.เชียงใหม่','maewang.np112@gmail.com','ทางเดินศึกษาธรรมชาติ,เที่ยวถ้ำ/ศึกษาสภาพธรณี,ดูนก/ดูผีเสื้อ,ดูดาว,ตั้งแคมป์พักแรม','ป่าเบญจพรรณ, ป่าเต็งรัง, ป่าสนเขา, ป่าดิบเขา','เก้ง, หมูป่า, เสือปลา, ลิงวอก, ชะนีมือขาว, ชะมดเช็ด, หมาไม้, เม่นหางพวง, ลิ่นชวา, กระต่ายป่า, กระรอกท้องแดง, ค้างคาวดอย, เหยี่ยวรุ้ง, นกกระทาทุ่ง, ไก่ป่า, ไก่ฟ้าหางลายขวาง, นกคุ่มอกลาย, นกเขาเขียว, นกบั้งรอกใหญ่, นกเค้าโมง, นกแอ่นตาล, นกขุนแผนหัวแดง, นกแก๊ก, นกโพระดก, นกหัวขวานด่างแคระ, นกปรอดทอง, นกแซงแซวหางปลา, นกกินปลีหางยาวคอสีฟ้า, เต่าปูลู, เต่าเหลือง, กิ้งก่าบินปีกแดง, แย้, ตะกวด, งูเหลือม, งูสามเหลี่ยม, งูจงอาง, อึ่งลาย, กบห้วย, ปาดบ้าน, คางคกบ้าน','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(11,'อุทยานแห่งชาติศรีลานนา','0 5347 9079, 0 5331 7495, 0 5347 9090','ต.บ้านเป้า อ.แม่แตง จ.เชียงใหม่ 50150','npsrilanna2566@gmail.com','ทางเดินศึกษาธรรมชาติ, เที่ยวน้ำตก, ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าสนเขา, ป่าดิบเขา','เก้ง, อ้นกลาง, เม่นหางพวง, หมาไน, ชะมดเช็ด, อีเห็นเครือ, แมวป่า, กระต่ายป่า, กระรอกหลากสี, หนูท้องขาว, ค้างคาวขอบหูขาวกลาง, ค้างคาวหน้ายาวใหญ่, นกกะลิงเขียด, นกกาแวน, อีกา, นกจับแมลงจุกดำ, นกขมิ้นน้อยธรรมดา, นกนิลตวาท้องสีส้ม, นกกางเขนดง, นกยอดหญ้าหัวดำ, นกกระจิบธรรมดา, นกกระจิ๊ดเขียวปีกสองแถบ, นกกินแมลงป่าอกสีน้ำตาล, งูทางมะพร้าวลายขีด, งูสิงบ้าน, จิ้งจกดินจุดลาย, ตุ๊กแกบ้าน, กิ้งก่าบินคอสีส้ม, กบบัว, เขียดจะนา, อึ่งอ่างบ้าน, อี่งแม่หนาว, คางคกบ้าน, ปาดแคระป่า, นกกะเต็นน้อยธรรมดา, นกเป็ดแดง, กบนา, กบหนอง, อึ่งอี๊ดข้างขีด, ปลาจาด, ปลาแม่แปป, ปลาซิวหนวดยาว, ปลาเวียน, ปลาเข็ม, ปลาบู่, ปลาสร้อยขาว','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท'),(12,'อุทยานแห่งชาติห้วยน้ำดัง (Huai Nam Dang)','082 187 7834, 084 908 1531, 093 632 1601','อุทยานแห่งชาติห้วยน้ำดัง หมู่ 5 ต.กึ๊ดช้าง อ.แม่แตง จ.เชียงใหม่ 50150','namdangnp@hotmail.co.th','ทางเดินศึกษาธรรมชาติ, เที่ยวน้ำตก, ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ดูดาว, อาบน้ำแร่/อบไอน้ำ, ตั้งแคมป์พักแรม','ป่าดิบชื้น, ป่าดิบเขา, ป่าเบญจพรรณ, ป่าเต็งรัง','ช้างป่า, กวางป่า, หมีควาย, เก้ง, กระจงเล็ก, เลียงผา, หมูป่า, แมวดาว, ชะมดเช็ด, ลิงวอก, ชะนีมือขาว, พังพอน, เม่นใหญ่, ไก่ป่า, ไก่ฟ้าสีเงิน, นกเขาเปล้า, นกขุนทอง, นกขมิ้นท้ายทอยดำ, นกปรอดคอลาย, เหยี่ยวต่างสี, กะท่าง, เต่าปูลู, เต่าใบไม้, ก้งก่าแก้ว, แย้, ตะกวด, งูเหลือม, งูเขียวดอกหมาก, งูเห่า, กบทูด, ปาด, เขียดป่าไผ่, อึ่งลาย','ชาวไทย: ผู้ใหญ่ 60 บาท เด็ก 30 บาท, ชาวต่างชาติ: ผู้ใหญ่ 150 บาท เด็ก 300 บาท'),(13,'อุทยานแห่งชาติออบขาน','08 6181 1068','อุทยานแห่งชาติออบขาน ต.น้ำแพร่ อ.หางดง จ.เชียงใหม่ 50230','obkhanpark@gmail.com','ทางเดินศึกษาธรรมชาติ, ทางเดินป่า, ชมประวัติศาสตร์/วัฒนธรรม, ชมพรรณไม้, ดูนก/ดูผีเสื้อ, ดูดาว, ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าดิบเขา, ป่าสนเขา','เลียงผา, เก้ง, หมีขอ, หมีควาย, เสือปลา, เสือไฟ, กระจง, อีเห็น, กระต่ายป่า, หมูป่า, ชะนี, ลิง, นางอาย, พังพอน, เม่น, หมาจิ้งจอก, กระรอก, กระแต, หนูต่างๆ, ตะพาบน้ำ, เต่าปูลู, ไก่ฟ้า','ไม่เก็บค่าบริการ'),(14,'อุทยานแห่งชาติออบหลวง','081 602 1290','ตู้ ปณ.2 ต.หางดง อ.ฮอด จ.เชียงใหม่ 50240','opluang68@gmail.com','ทางเดินศึกษาธรรมชาติ, ชมพรรณไม้, เที่ยวน้ำตก, ดูนก/ดูผีเสื้อ, อาบน้ำแร่/อบไอน้ำ, ชมประวัติศาสตร์/วัฒนธรรม,  ตั้งแคมป์พักแรม','ป่าเต็งรัง, ป่าเบญจพรรณ, ป่าดิบแล้ง, ป่าดิบเขา, ป่าสนเขา','อีเก้งธรรมดา, หมูป่า, ชะนี, ชะมด, กระต่ายป่า, นกกางเขนบ้าน, นกกางเขนดง, งู','ชาวไทย: ผู้ใหญ่ 20 บาท เด็ก 10 บาท, ชาวต่างชาติ: ผู้ใหญ่ 100 บาท เด็ก 50 บาท');
/*!40000 ALTER TABLE `parks` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-18 13:19:07
